Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm036.h
/*-------------------------------------------------------------------------
 * PIC32MM0064GPM036 processor header
 * Build date : Aug 27 2021
 *
 * Copyright (c) 2021, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its
 * subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are 
 * met:
 * 
 * 1.      Redistributions of source code must retain the above copyright
 *         notice, this list of conditions and the following disclaimer.
 * 2.      Redistributions in binary form must reproduce the above 
 *         copyright notice, this list of conditions and the following 
 *         disclaimer in the documentation and/or other materials provided 
 *         with the distribution. Publication is not required when this file 
 *         is used in an embedded application.
 * 3.      Microchip's name may not be used to endorse or promote products
 *         derived from this software without specific prior written 
 *         permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR 
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */

#pragma once
#ifndef __32MM0064GPM036_H
#define __32MM0064GPM036_H

#if defined (__LANGUAGE_C__) || defined (__LANGUAGE_C_PLUS_PLUS)

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#define RTCCON1 RTCCON1
extern volatile uint32_t   RTCCON1 __attribute__((section("sfrs"), address(0xBF800000)));
typedef struct {
  uint32_t :4;
  uint32_t OUTSEL:3;
  uint32_t RTCOE:1;
  uint32_t :3;
  uint32_t WRLOCK:1;
  uint32_t :3;
  uint32_t ON:1;
  uint32_t ALMRPT:8;
  uint32_t AMASK:4;
  uint32_t :2;
  uint32_t CHIME:1;
  uint32_t ALRMEN:1;
} __RTCCON1bits_t;
extern volatile __RTCCON1bits_t RTCCON1bits __asm__ ("RTCCON1") __attribute__((section("sfrs"), address(0xBF800000)));
extern volatile uint32_t        RTCCON1CLR __attribute__((section("sfrs"),address(0xBF800004)));
extern volatile uint32_t        RTCCON1SET __attribute__((section("sfrs"),address(0xBF800008)));
extern volatile uint32_t        RTCCON1INV __attribute__((section("sfrs"),address(0xBF80000C)));
#define RTCCON2 RTCCON2
extern volatile uint32_t   RTCCON2 __attribute__((section("sfrs"), address(0xBF800010)));
typedef struct {
  uint32_t CLKSEL:2;
  uint32_t :9;
  uint32_t FDIV:5;
  uint32_t DIV:16;
} __RTCCON2bits_t;
extern volatile __RTCCON2bits_t RTCCON2bits __asm__ ("RTCCON2") __attribute__((section("sfrs"), address(0xBF800010)));
extern volatile uint32_t        RTCCON2CLR __attribute__((section("sfrs"),address(0xBF800014)));
extern volatile uint32_t        RTCCON2SET __attribute__((section("sfrs"),address(0xBF800018)));
extern volatile uint32_t        RTCCON2INV __attribute__((section("sfrs"),address(0xBF80001C)));
#define RTCSTAT RTCSTAT
extern volatile uint32_t   RTCSTAT __attribute__((section("sfrs"), address(0xBF800030)));
typedef struct {
  uint32_t HALFSEC:1;
  uint32_t ALMSYNC:1;
  uint32_t SYNC:1;
  uint32_t :2;
  uint32_t ALMEVT:1;
} __RTCSTATbits_t;
extern volatile __RTCSTATbits_t RTCSTATbits __asm__ ("RTCSTAT") __attribute__((section("sfrs"), address(0xBF800030)));
extern volatile uint32_t        RTCSTATCLR __attribute__((section("sfrs"),address(0xBF800034)));
extern volatile uint32_t        RTCSTATSET __attribute__((section("sfrs"),address(0xBF800038)));
extern volatile uint32_t        RTCSTATINV __attribute__((section("sfrs"),address(0xBF80003C)));
#define RTCTIME RTCTIME
extern volatile uint32_t   RTCTIME __attribute__((section("sfrs"), address(0xBF800040)));
typedef struct {
  uint32_t :8;
  uint32_t SECONE:4;
  uint32_t SECTEN:3;
  uint32_t :1;
  uint32_t MINONE:4;
  uint32_t MINTEN:3;
  uint32_t :1;
  uint32_t HRONE:4;
  uint32_t HRTEN:3;
} __RTCTIMEbits_t;
extern volatile __RTCTIMEbits_t RTCTIMEbits __asm__ ("RTCTIME") __attribute__((section("sfrs"), address(0xBF800040)));
extern volatile uint32_t        RTCTIMECLR __attribute__((section("sfrs"),address(0xBF800044)));
extern volatile uint32_t        RTCTIMESET __attribute__((section("sfrs"),address(0xBF800048)));
extern volatile uint32_t        RTCTIMEINV __attribute__((section("sfrs"),address(0xBF80004C)));
#define RTCDATE RTCDATE
extern volatile uint32_t   RTCDATE __attribute__((section("sfrs"), address(0xBF800050)));
typedef struct {
  uint32_t WDAY:3;
  uint32_t :5;
  uint32_t DAYONE:4;
  uint32_t DAYTEN:2;
  uint32_t :2;
  uint32_t MTHONE:4;
  uint32_t MTHTEN:1;
  uint32_t :3;
  uint32_t YRONE:4;
  uint32_t YRTEN:4;
} __RTCDATEbits_t;
extern volatile __RTCDATEbits_t RTCDATEbits __asm__ ("RTCDATE") __attribute__((section("sfrs"), address(0xBF800050)));
extern volatile uint32_t        RTCDATECLR __attribute__((section("sfrs"),address(0xBF800054)));
extern volatile uint32_t        RTCDATESET __attribute__((section("sfrs"),address(0xBF800058)));
extern volatile uint32_t        RTCDATEINV __attribute__((section("sfrs"),address(0xBF80005C)));
#define ALMTIME ALMTIME
extern volatile uint32_t   ALMTIME __attribute__((section("sfrs"), address(0xBF800060)));
typedef struct {
  uint32_t :8;
  uint32_t SECONE:4;
  uint32_t SECTEN:3;
  uint32_t :1;
  uint32_t MINONE:4;
  uint32_t MINTEN:3;
  uint32_t :1;
  uint32_t HRONE:4;
  uint32_t HRTEN:3;
} __ALMTIMEbits_t;
extern volatile __ALMTIMEbits_t ALMTIMEbits __asm__ ("ALMTIME") __attribute__((section("sfrs"), address(0xBF800060)));
extern volatile uint32_t        ALMTIMECLR __attribute__((section("sfrs"),address(0xBF800064)));
extern volatile uint32_t        ALMTIMESET __attribute__((section("sfrs"),address(0xBF800068)));
extern volatile uint32_t        ALMTIMEINV __attribute__((section("sfrs"),address(0xBF80006C)));
#define ALMDATE ALMDATE
extern volatile uint32_t   ALMDATE __attribute__((section("sfrs"), address(0xBF800070)));
typedef struct {
  uint32_t WDAY:3;
  uint32_t :5;
  uint32_t DAYONE:4;
  uint32_t DAYTEN:2;
  uint32_t :2;
  uint32_t MTHONE:4;
  uint32_t MTHTEN:1;
} __ALMDATEbits_t;
extern volatile __ALMDATEbits_t ALMDATEbits __asm__ ("ALMDATE") __attribute__((section("sfrs"), address(0xBF800070)));
extern volatile uint32_t        ALMDATECLR __attribute__((section("sfrs"),address(0xBF800074)));
extern volatile uint32_t        ALMDATESET __attribute__((section("sfrs"),address(0xBF800078)));
extern volatile uint32_t        ALMDATEINV __attribute__((section("sfrs"),address(0xBF80007C)));
#define CCP1CON1 CCP1CON1
extern volatile uint32_t   CCP1CON1 __attribute__((section("sfrs"), address(0xBF800100)));
typedef struct {
  uint32_t MOD:4;
  uint32_t CCSEL:1;
  uint32_t T32:1;
  uint32_t TMRPS:2;
  uint32_t CLKSEL:3;
  uint32_t TMRSYNC:1;
  uint32_t CCPSLP:1;
  uint32_t SIDL:1;
  uint32_t :1;
  uint32_t ON:1;
  uint32_t SYNC:5;
  uint32_t ALTSYNC:1;
  uint32_t ONESHOT:1;
  uint32_t TRIGEN:1;
  uint32_t OPS:4;
  uint32_t :2;
  uint32_t RTRGEN:1;
  uint32_t OPSSRC:1;
} __CCP1CON1bits_t;
extern volatile __CCP1CON1bits_t CCP1CON1bits __asm__ ("CCP1CON1") __attribute__((section("sfrs"), address(0xBF800100)));
extern volatile uint32_t        CCP1CON1CLR __attribute__((section("sfrs"),address(0xBF800104)));
extern volatile uint32_t        CCP1CON1SET __attribute__((section("sfrs"),address(0xBF800108)));
extern volatile uint32_t        CCP1CON1INV __attribute__((section("sfrs"),address(0xBF80010C)));
#define CCP1CON2 CCP1CON2
extern volatile uint32_t   CCP1CON2 __attribute__((section("sfrs"), address(0xBF800110)));
typedef struct {
  uint32_t ASDG:8;
  uint32_t :4;
  uint32_t SSDG:1;
  uint32_t :1;
  uint32_t ASDGM:1;
  uint32_t PWMRSEN:1;
  uint32_t ICS:3;
  uint32_t AUXOUT:2;
  uint32_t :1;
  uint32_t ICGSM:2;
  uint32_t OCAEN:1;
  uint32_t OCBEN:1;
  uint32_t OCCEN:1;
  uint32_t OCDEN:1;
  uint32_t OCEEN:1;
  uint32_t OCFEN:1;
  uint32_t :1;
  uint32_t OENSYNC:1;
} __CCP1CON2bits_t;
extern volatile __CCP1CON2bits_t CCP1CON2bits __asm__ ("CCP1CON2") __attribute__((section("sfrs"), address(0xBF800110)));
extern volatile uint32_t        CCP1CON2CLR __attribute__((section("sfrs"),address(0xBF800114)));
extern volatile uint32_t        CCP1CON2SET __attribute__((section("sfrs"),address(0xBF800118)));
extern volatile uint32_t        CCP1CON2INV __attribute__((section("sfrs"),address(0xBF80011C)));
#define CCP1CON3 CCP1CON3
extern volatile uint32_t   CCP1CON3 __attribute__((section("sfrs"), address(0xBF800120)));
typedef struct {
  uint32_t DT:6;
  uint32_t :10;
  uint32_t PSSBDF:2;
  uint32_t PSSACE:2;
  uint32_t POLBDF:1;
  uint32_t POLACE:1;
  uint32_t :2;
  uint32_t OUTM:3;
  uint32_t :1;
  uint32_t OSCNT:3;
  uint32_t OETRIG:1;
} __CCP1CON3bits_t;
extern volatile __CCP1CON3bits_t CCP1CON3bits __asm__ ("CCP1CON3") __attribute__((section("sfrs"), address(0xBF800120)));
extern volatile uint32_t        CCP1CON3CLR __attribute__((section("sfrs"),address(0xBF800124)));
extern volatile uint32_t        CCP1CON3SET __attribute__((section("sfrs"),address(0xBF800128)));
extern volatile uint32_t        CCP1CON3INV __attribute__((section("sfrs"),address(0xBF80012C)));
#define CCP1STAT CCP1STAT
extern volatile uint32_t   CCP1STAT __attribute__((section("sfrs"), address(0xBF800130)));
typedef struct {
  uint32_t ICBNE:1;
  uint32_t ICOV:1;
  uint32_t ICDIS:1;
  uint32_t SCEVT:1;
  uint32_t ASEVT:1;
  uint32_t TRCLR:1;
  uint32_t TRSET:1;
  uint32_t CCPTRIG:1;
  uint32_t :2;
  uint32_t ICGARM:1;
  uint32_t :5;
  uint32_t RAWIP:1;
  uint32_t RBWIP:1;
  uint32_t TMRLWIP:1;
  uint32_t TMRHWIP:1;
  uint32_t PRLWIP:1;
} __CCP1STATbits_t;
extern volatile __CCP1STATbits_t CCP1STATbits __asm__ ("CCP1STAT") __attribute__((section("sfrs"), address(0xBF800130)));
extern volatile uint32_t        CCP1STATCLR __attribute__((section("sfrs"),address(0xBF800134)));
extern volatile uint32_t        CCP1STATSET __attribute__((section("sfrs"),address(0xBF800138)));
extern volatile uint32_t        CCP1STATINV __attribute__((section("sfrs"),address(0xBF80013C)));
#define CCP1TMR CCP1TMR
extern volatile uint32_t   CCP1TMR __attribute__((section("sfrs"), address(0xBF800140)));
typedef union {
  struct {
    uint32_t TMRL:16;
    uint32_t TMRH:16;
  };
  struct {
    uint32_t TMR:32;
  };
} __CCP1TMRbits_t;
extern volatile __CCP1TMRbits_t CCP1TMRbits __asm__ ("CCP1TMR") __attribute__((section("sfrs"), address(0xBF800140)));
extern volatile uint32_t        CCP1TMRCLR __attribute__((section("sfrs"),address(0xBF800144)));
extern volatile uint32_t        CCP1TMRSET __attribute__((section("sfrs"),address(0xBF800148)));
extern volatile uint32_t        CCP1TMRINV __attribute__((section("sfrs"),address(0xBF80014C)));
#define CCP1PR CCP1PR
extern volatile uint32_t   CCP1PR __attribute__((section("sfrs"), address(0xBF800150)));
typedef union {
  struct {
    uint32_t PRL:16;
    uint32_t PRH:16;
  };
  struct {
    uint32_t PR:32;
  };
} __CCP1PRbits_t;
extern volatile __CCP1PRbits_t CCP1PRbits __asm__ ("CCP1PR") __attribute__((section("sfrs"), address(0xBF800150)));
extern volatile uint32_t        CCP1PRCLR __attribute__((section("sfrs"),address(0xBF800154)));
extern volatile uint32_t        CCP1PRSET __attribute__((section("sfrs"),address(0xBF800158)));
extern volatile uint32_t        CCP1PRINV __attribute__((section("sfrs"),address(0xBF80015C)));
#define CCP1RA CCP1RA
extern volatile uint32_t   CCP1RA __attribute__((section("sfrs"), address(0xBF800160)));
typedef struct {
  uint32_t CMPA:16;
} __CCP1RAbits_t;
extern volatile __CCP1RAbits_t CCP1RAbits __asm__ ("CCP1RA") __attribute__((section("sfrs"), address(0xBF800160)));
extern volatile uint32_t        CCP1RACLR __attribute__((section("sfrs"),address(0xBF800164)));
extern volatile uint32_t        CCP1RASET __attribute__((section("sfrs"),address(0xBF800168)));
extern volatile uint32_t        CCP1RAINV __attribute__((section("sfrs"),address(0xBF80016C)));
#define CCP1RB CCP1RB
extern volatile uint32_t   CCP1RB __attribute__((section("sfrs"), address(0xBF800170)));
typedef struct {
  uint32_t CMPB:16;
} __CCP1RBbits_t;
extern volatile __CCP1RBbits_t CCP1RBbits __asm__ ("CCP1RB") __attribute__((section("sfrs"), address(0xBF800170)));
extern volatile uint32_t        CCP1RBCLR __attribute__((section("sfrs"),address(0xBF800174)));
extern volatile uint32_t        CCP1RBSET __attribute__((section("sfrs"),address(0xBF800178)));
extern volatile uint32_t        CCP1RBINV __attribute__((section("sfrs"),address(0xBF80017C)));
#define CCP1BUF CCP1BUF
extern volatile uint32_t   CCP1BUF __attribute__((section("sfrs"), address(0xBF800180)));
typedef union {
  struct {
    uint32_t BUFL:16;
    uint32_t BUFH:16;
  };
  struct {
    uint32_t BUF:32;
  };
} __CCP1BUFbits_t;
