Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm036.h
extern volatile __IPC1bits_t IPC1bits __asm__ ("IPC1") __attribute__((section("sfrs"), address(0xBF80F150)));
extern volatile uint32_t        IPC1CLR __attribute__((section("sfrs"),address(0xBF80F154)));
extern volatile uint32_t        IPC1SET __attribute__((section("sfrs"),address(0xBF80F158)));
extern volatile uint32_t        IPC1INV __attribute__((section("sfrs"),address(0xBF80F15C)));
#define IPC2 IPC2
extern volatile uint32_t   IPC2 __attribute__((section("sfrs"), address(0xBF80F160)));
typedef struct {
  uint32_t CNAIS:2;
  uint32_t CNAIP:3;
  uint32_t :3;
  uint32_t CNBIS:2;
  uint32_t CNBIP:3;
  uint32_t :3;
  uint32_t CNCIS:2;
  uint32_t CNCIP:3;
  uint32_t :3;
  uint32_t CNDIS:2;
  uint32_t CNDIP:3;
} __IPC2bits_t;
extern volatile __IPC2bits_t IPC2bits __asm__ ("IPC2") __attribute__((section("sfrs"), address(0xBF80F160)));
extern volatile uint32_t        IPC2CLR __attribute__((section("sfrs"),address(0xBF80F164)));
extern volatile uint32_t        IPC2SET __attribute__((section("sfrs"),address(0xBF80F168)));
extern volatile uint32_t        IPC2INV __attribute__((section("sfrs"),address(0xBF80F16C)));
#define IPC3 IPC3
extern volatile uint32_t   IPC3 __attribute__((section("sfrs"), address(0xBF80F170)));
extern volatile uint32_t        IPC3CLR __attribute__((section("sfrs"),address(0xBF80F174)));
extern volatile uint32_t        IPC3SET __attribute__((section("sfrs"),address(0xBF80F178)));
extern volatile uint32_t        IPC3INV __attribute__((section("sfrs"),address(0xBF80F17C)));
#define IPC4 IPC4
extern volatile uint32_t   IPC4 __attribute__((section("sfrs"), address(0xBF80F180)));
typedef struct {
  uint32_t :8;
  uint32_t T1IS:2;
  uint32_t T1IP:3;
  uint32_t :3;
  uint32_t T2IS:2;
  uint32_t T2IP:3;
  uint32_t :3;
  uint32_t T3IS:2;
  uint32_t T3IP:3;
} __IPC4bits_t;
extern volatile __IPC4bits_t IPC4bits __asm__ ("IPC4") __attribute__((section("sfrs"), address(0xBF80F180)));
extern volatile uint32_t        IPC4CLR __attribute__((section("sfrs"),address(0xBF80F184)));
extern volatile uint32_t        IPC4SET __attribute__((section("sfrs"),address(0xBF80F188)));
extern volatile uint32_t        IPC4INV __attribute__((section("sfrs"),address(0xBF80F18C)));
#define IPC5 IPC5
extern volatile uint32_t   IPC5 __attribute__((section("sfrs"), address(0xBF80F190)));
typedef struct {
  uint32_t :24;
  uint32_t CMP1IS:2;
  uint32_t CMP1IP:3;
} __IPC5bits_t;
extern volatile __IPC5bits_t IPC5bits __asm__ ("IPC5") __attribute__((section("sfrs"), address(0xBF80F190)));
extern volatile uint32_t        IPC5CLR __attribute__((section("sfrs"),address(0xBF80F194)));
extern volatile uint32_t        IPC5SET __attribute__((section("sfrs"),address(0xBF80F198)));
extern volatile uint32_t        IPC5INV __attribute__((section("sfrs"),address(0xBF80F19C)));
#define IPC6 IPC6
extern volatile uint32_t   IPC6 __attribute__((section("sfrs"), address(0xBF80F1A0)));
typedef struct {
  uint32_t CMP2IS:2;
  uint32_t CMP2IP:3;
  uint32_t :3;
  uint32_t CMP3IS:2;
  uint32_t CMP3IP:3;
} __IPC6bits_t;
extern volatile __IPC6bits_t IPC6bits __asm__ ("IPC6") __attribute__((section("sfrs"), address(0xBF80F1A0)));
extern volatile uint32_t        IPC6CLR __attribute__((section("sfrs"),address(0xBF80F1A4)));
extern volatile uint32_t        IPC6SET __attribute__((section("sfrs"),address(0xBF80F1A8)));
extern volatile uint32_t        IPC6INV __attribute__((section("sfrs"),address(0xBF80F1AC)));
#define IPC7 IPC7
extern volatile uint32_t   IPC7 __attribute__((section("sfrs"), address(0xBF80F1B0)));
typedef struct {
  uint32_t :8;
  uint32_t USBIS:2;
  uint32_t USBIP:3;
} __IPC7bits_t;
extern volatile __IPC7bits_t IPC7bits __asm__ ("IPC7") __attribute__((section("sfrs"), address(0xBF80F1B0)));
extern volatile uint32_t        IPC7CLR __attribute__((section("sfrs"),address(0xBF80F1B4)));
extern volatile uint32_t        IPC7SET __attribute__((section("sfrs"),address(0xBF80F1B8)));
extern volatile uint32_t        IPC7INV __attribute__((section("sfrs"),address(0xBF80F1BC)));
#define IPC8 IPC8
extern volatile uint32_t   IPC8 __attribute__((section("sfrs"), address(0xBF80F1C0)));
typedef struct {
  uint32_t RTCCIS:2;
  uint32_t RTCCIP:3;
  uint32_t :3;
  uint32_t AD1IS:2;
  uint32_t AD1IP:3;
} __IPC8bits_t;
extern volatile __IPC8bits_t IPC8bits __asm__ ("IPC8") __attribute__((section("sfrs"), address(0xBF80F1C0)));
extern volatile uint32_t        IPC8CLR __attribute__((section("sfrs"),address(0xBF80F1C4)));
extern volatile uint32_t        IPC8SET __attribute__((section("sfrs"),address(0xBF80F1C8)));
extern volatile uint32_t        IPC8INV __attribute__((section("sfrs"),address(0xBF80F1CC)));
#define IPC9 IPC9
extern volatile uint32_t   IPC9 __attribute__((section("sfrs"), address(0xBF80F1D0)));
typedef struct {
  uint32_t LVDIS:2;
  uint32_t LVDIP:3;
  uint32_t :3;
  uint32_t CLC1IS:2;
  uint32_t CLC1IP:3;
  uint32_t :3;
  uint32_t CLC2IS:2;
  uint32_t CLC2IP:3;
  uint32_t :3;
  uint32_t CLC3IS:2;
  uint32_t CLC3IP:3;
} __IPC9bits_t;
extern volatile __IPC9bits_t IPC9bits __asm__ ("IPC9") __attribute__((section("sfrs"), address(0xBF80F1D0)));
extern volatile uint32_t        IPC9CLR __attribute__((section("sfrs"),address(0xBF80F1D4)));
extern volatile uint32_t        IPC9SET __attribute__((section("sfrs"),address(0xBF80F1D8)));
extern volatile uint32_t        IPC9INV __attribute__((section("sfrs"),address(0xBF80F1DC)));
#define IPC10 IPC10
extern volatile uint32_t   IPC10 __attribute__((section("sfrs"), address(0xBF80F1E0)));
typedef struct {
  uint32_t CLC4IS:2;
  uint32_t CLC4IP:3;
  uint32_t :3;
  uint32_t SPI1EIS:2;
  uint32_t SPI1EIP:3;
  uint32_t :3;
  uint32_t SPI1TXIS:2;
  uint32_t SPI1TXIP:3;
  uint32_t :3;
  uint32_t SPI1RXIS:2;
  uint32_t SPI1RXIP:3;
} __IPC10bits_t;
extern volatile __IPC10bits_t IPC10bits __asm__ ("IPC10") __attribute__((section("sfrs"), address(0xBF80F1E0)));
extern volatile uint32_t        IPC10CLR __attribute__((section("sfrs"),address(0xBF80F1E4)));
extern volatile uint32_t        IPC10SET __attribute__((section("sfrs"),address(0xBF80F1E8)));
extern volatile uint32_t        IPC10INV __attribute__((section("sfrs"),address(0xBF80F1EC)));
#define IPC11 IPC11
extern volatile uint32_t   IPC11 __attribute__((section("sfrs"), address(0xBF80F1F0)));
typedef struct {
  uint32_t SPI2EIS:2;
  uint32_t SPI2EIP:3;
  uint32_t :3;
  uint32_t SPI2TXIS:2;
  uint32_t SPI2TXIP:3;
  uint32_t :3;
  uint32_t SPI2RXIS:2;
  uint32_t SPI2RXIP:3;
  uint32_t :3;
  uint32_t SPI3EIS:2;
  uint32_t SPI3EIP:3;
} __IPC11bits_t;
extern volatile __IPC11bits_t IPC11bits __asm__ ("IPC11") __attribute__((section("sfrs"), address(0xBF80F1F0)));
extern volatile uint32_t        IPC11CLR __attribute__((section("sfrs"),address(0xBF80F1F4)));
extern volatile uint32_t        IPC11SET __attribute__((section("sfrs"),address(0xBF80F1F8)));
extern volatile uint32_t        IPC11INV __attribute__((section("sfrs"),address(0xBF80F1FC)));
#define IPC12 IPC12
extern volatile uint32_t   IPC12 __attribute__((section("sfrs"), address(0xBF80F200)));
typedef struct {
  uint32_t SPI3TXIS:2;
  uint32_t SPI3TXIP:3;
  uint32_t :3;
  uint32_t SPI3RXIS:2;
  uint32_t SPI3RXIP:3;
} __IPC12bits_t;
