Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm036.h
  .extern ADC1BUF5INV      /* 0xBF80215C */
  .extern ADC1BUF6         /* 0xBF802160 */
  .extern ADC1BUF6CLR      /* 0xBF802164 */
  .extern ADC1BUF6SET      /* 0xBF802168 */
  .extern ADC1BUF6INV      /* 0xBF80216C */
  .extern ADC1BUF7         /* 0xBF802170 */
  .extern ADC1BUF7CLR      /* 0xBF802174 */
  .extern ADC1BUF7SET      /* 0xBF802178 */
  .extern ADC1BUF7INV      /* 0xBF80217C */
  .extern ADC1BUF8         /* 0xBF802180 */
  .extern ADC1BUF8CLR      /* 0xBF802184 */
  .extern ADC1BUF8SET      /* 0xBF802188 */
  .extern ADC1BUF8INV      /* 0xBF80218C */
  .extern ADC1BUF9         /* 0xBF802190 */
  .extern ADC1BUF9CLR      /* 0xBF802194 */
  .extern ADC1BUF9SET      /* 0xBF802198 */
  .extern ADC1BUF9INV      /* 0xBF80219C */
  .extern ADC1BUF10        /* 0xBF8021A0 */
  .extern ADC1BUF10CLR     /* 0xBF8021A4 */
  .extern ADC1BUF10SET     /* 0xBF8021A8 */
  .extern ADC1BUF10INV     /* 0xBF8021AC */
  .extern ADC1BUF11        /* 0xBF8021B0 */
  .extern ADC1BUF11CLR     /* 0xBF8021B4 */
  .extern ADC1BUF11SET     /* 0xBF8021B8 */
  .extern ADC1BUF11INV     /* 0xBF8021BC */
  .extern ADC1BUF12        /* 0xBF8021C0 */
  .extern ADC1BUF12CLR     /* 0xBF8021C4 */
  .extern ADC1BUF12SET     /* 0xBF8021C8 */
  .extern ADC1BUF12INV     /* 0xBF8021CC */
  .extern ADC1BUF13        /* 0xBF8021D0 */
  .extern ADC1BUF13CLR     /* 0xBF8021D4 */
  .extern ADC1BUF13SET     /* 0xBF8021D8 */
  .extern ADC1BUF13INV     /* 0xBF8021DC */
  .extern ADC1BUF14        /* 0xBF8021E0 */
  .extern ADC1BUF14CLR     /* 0xBF8021E4 */
  .extern ADC1BUF14SET     /* 0xBF8021E8 */
  .extern ADC1BUF14INV     /* 0xBF8021EC */
  .extern ADC1BUF15        /* 0xBF8021F0 */
  .extern ADC1BUF15CLR     /* 0xBF8021F4 */
  .extern ADC1BUF15SET     /* 0xBF8021F8 */
  .extern ADC1BUF15INV     /* 0xBF8021FC */
  .extern ADC1BUF16        /* 0xBF802200 */
  .extern ADC1BUF16CLR     /* 0xBF802204 */
  .extern ADC1BUF16SET     /* 0xBF802208 */
  .extern ADC1BUF16INV     /* 0xBF80220C */
  .extern ADC1BUF17        /* 0xBF802210 */
  .extern ADC1BUF17CLR     /* 0xBF802214 */
  .extern ADC1BUF17SET     /* 0xBF802218 */
  .extern ADC1BUF17INV     /* 0xBF80221C */
  .extern ADC1BUF18        /* 0xBF802220 */
  .extern ADC1BUF18CLR     /* 0xBF802224 */
  .extern ADC1BUF18SET     /* 0xBF802228 */
  .extern ADC1BUF18INV     /* 0xBF80222C */
  .extern ADC1BUF19        /* 0xBF802230 */
  .extern ADC1BUF19CLR     /* 0xBF802234 */
  .extern ADC1BUF19SET     /* 0xBF802238 */
  .extern ADC1BUF19INV     /* 0xBF80223C */
  .extern ADC1BUF20        /* 0xBF802240 */
  .extern ADC1BUF20CLR     /* 0xBF802244 */
  .extern ADC1BUF20SET     /* 0xBF802248 */
  .extern ADC1BUF20INV     /* 0xBF80224C */
  .extern ADC1BUF21        /* 0xBF802250 */
  .extern ADC1BUF21CLR     /* 0xBF802254 */
  .extern ADC1BUF21SET     /* 0xBF802258 */
  .extern ADC1BUF21INV     /* 0xBF80225C */
  .extern AD1CON1          /* 0xBF802260 */
  .extern AD1CON1CLR       /* 0xBF802264 */
  .extern AD1CON1SET       /* 0xBF802268 */
  .extern AD1CON1INV       /* 0xBF80226C */
  .extern AD1CON2          /* 0xBF802270 */
  .extern AD1CON2CLR       /* 0xBF802274 */
  .extern AD1CON2SET       /* 0xBF802278 */
  .extern AD1CON2INV       /* 0xBF80227C */
  .extern AD1CON3          /* 0xBF802280 */
  .extern AD1CON3CLR       /* 0xBF802284 */
  .extern AD1CON3SET       /* 0xBF802288 */
  .extern AD1CON3INV       /* 0xBF80228C */
  .extern AD1CHS           /* 0xBF802290 */
  .extern AD1CHSCLR        /* 0xBF802294 */
  .extern AD1CHSSET        /* 0xBF802298 */
  .extern AD1CHSINV        /* 0xBF80229C */
  .extern AD1CSS           /* 0xBF8022A0 */
  .extern AD1CSSCLR        /* 0xBF8022A4 */
  .extern AD1CSSSET        /* 0xBF8022A8 */
  .extern AD1CSSINV        /* 0xBF8022AC */
  .extern AD1CON5          /* 0xBF8022C0 */
  .extern AD1CON5CLR       /* 0xBF8022C4 */
  .extern AD1CON5SET       /* 0xBF8022C8 */
  .extern AD1CON5INV       /* 0xBF8022CC */
  .extern AD1CHIT          /* 0xBF8022D0 */
  .extern AD1CHITCLR       /* 0xBF8022D4 */
  .extern AD1CHITSET       /* 0xBF8022D8 */
  .extern AD1CHITINV       /* 0xBF8022DC */
  .extern CMSTAT           /* 0xBF802300 */
  .extern CMSTATCLR        /* 0xBF802304 */
  .extern CMSTATSET        /* 0xBF802308 */
  .extern CMSTATINV        /* 0xBF80230C */
  .extern CM1CON           /* 0xBF802310 */
  .extern CM1CONCLR        /* 0xBF802314 */
  .extern CM1CONSET        /* 0xBF802318 */
  .extern CM1CONINV        /* 0xBF80231C */
  .extern CM2CON           /* 0xBF802330 */
  .extern CM2CONCLR        /* 0xBF802334 */
  .extern CM2CONSET        /* 0xBF802338 */
  .extern CM2CONINV        /* 0xBF80233C */
  .extern CM3CON           /* 0xBF802350 */
  .extern CM3CONCLR        /* 0xBF802354 */
  .extern CM3CONSET        /* 0xBF802358 */
  .extern CM3CONINV        /* 0xBF80235C */
  .extern DAC1CON          /* 0xBF802380 */
  .extern DAC1CONCLR       /* 0xBF802384 */
  .extern DAC1CONSET       /* 0xBF802388 */
  .extern DAC1CONINV       /* 0xBF80238C */
  .extern CLC1CON          /* 0xBF802480 */
  .extern CLC1CONCLR       /* 0xBF802484 */
  .extern CLC1CONSET       /* 0xBF802488 */
  .extern CLC1CONINV       /* 0xBF80248C */
  .extern CLC1SEL          /* 0xBF802490 */
  .extern CLC1SELCLR       /* 0xBF802494 */
  .extern CLC1SELSET       /* 0xBF802498 */
  .extern CLC1SELINV       /* 0xBF80249C */
  .extern CLC1GLS          /* 0xBF8024A0 */
  .extern CLC1GLSCLR       /* 0xBF8024A4 */
  .extern CLC1GLSSET       /* 0xBF8024A8 */
  .extern CLC1GLSINV       /* 0xBF8024AC */
  .extern CLC2CON          /* 0xBF802500 */
  .extern CLC2CONCLR       /* 0xBF802504 */
  .extern CLC2CONSET       /* 0xBF802508 */
  .extern CLC2CONINV       /* 0xBF80250C */
  .extern CLC2SEL          /* 0xBF802510 */
  .extern CLC2SELCLR       /* 0xBF802514 */
  .extern CLC2SELSET       /* 0xBF802518 */
  .extern CLC2SELINV       /* 0xBF80251C */
  .extern CLC2GLS          /* 0xBF802520 */
  .extern CLC2GLSCLR       /* 0xBF802524 */
  .extern CLC2GLSSET       /* 0xBF802528 */
  .extern CLC2GLSINV       /* 0xBF80252C */
  .extern CLC3CON          /* 0xBF802580 */
  .extern CLC3CONCLR       /* 0xBF802584 */
  .extern CLC3CONSET       /* 0xBF802588 */
  .extern CLC3CONINV       /* 0xBF80258C */
  .extern CLC3SEL          /* 0xBF802590 */
  .extern CLC3SELCLR       /* 0xBF802594 */
  .extern CLC3SELSET       /* 0xBF802598 */
  .extern CLC3SELINV       /* 0xBF80259C */
  .extern CLC3GLS          /* 0xBF8025A0 */
  .extern CLC3GLSCLR       /* 0xBF8025A4 */
  .extern CLC3GLSSET       /* 0xBF8025A8 */
  .extern CLC3GLSINV       /* 0xBF8025AC */
  .extern CLC4CON          /* 0xBF802600 */
  .extern CLC4CONCLR       /* 0xBF802604 */
  .extern CLC4CONSET       /* 0xBF802608 */
  .extern CLC4CONINV       /* 0xBF80260C */
  .extern CLC4SEL          /* 0xBF802610 */
  .extern CLC4SELCLR       /* 0xBF802614 */
  .extern CLC4SELSET       /* 0xBF802618 */
  .extern CLC4SELINV       /* 0xBF80261C */
  .extern CLC4GLS          /* 0xBF802620 */
  .extern CLC4GLSCLR       /* 0xBF802624 */
  .extern CLC4GLSSET       /* 0xBF802628 */
  .extern CLC4GLSINV       /* 0xBF80262C */
  .extern OSCCON           /* 0xBF802680 */
  .extern OSCCONCLR        /* 0xBF802684 */
  .extern OSCCONSET        /* 0xBF802688 */
  .extern OSCCONINV        /* 0xBF80268C */
  .extern SPLLCON          /* 0xBF8026A0 */
  .extern SPLLCONCLR       /* 0xBF8026A4 */
  .extern SPLLCONSET       /* 0xBF8026A8 */
  .extern SPLLCONINV       /* 0xBF8026AC */
  .extern RCON             /* 0xBF8026E0 */
  .extern RCONCLR          /* 0xBF8026E4 */
  .extern RCONSET          /* 0xBF8026E8 */
  .extern RCONINV          /* 0xBF8026EC */
  .extern RSWRST           /* 0xBF8026F0 */
  .extern RSWRSTCLR        /* 0xBF8026F4 */
  .extern RSWRSTSET        /* 0xBF8026F8 */
  .extern RSWRSTINV        /* 0xBF8026FC */
  .extern RNMICON          /* 0xBF802700 */
  .extern RNMICONCLR       /* 0xBF802704 */
  .extern RNMICONSET       /* 0xBF802708 */
  .extern RNMICONINV       /* 0xBF80270C */
  .extern PWRCON           /* 0xBF802710 */
  .extern PWRCONCLR        /* 0xBF802714 */
  .extern PWRCONSET        /* 0xBF802718 */
  .extern PWRCONINV        /* 0xBF80271C */
  .extern REFO1CON         /* 0xBF802720 */
  .extern REFO1CONCLR      /* 0xBF802724 */
  .extern REFO1CONSET      /* 0xBF802728 */
  .extern REFO1CONINV      /* 0xBF80272C */
  .extern REFO1TRIM        /* 0xBF802730 */
  .extern REFO1TRIMCLR     /* 0xBF802734 */
  .extern REFO1TRIMSET     /* 0xBF802738 */
  .extern REFO1TRIMINV     /* 0xBF80273C */
  .extern CLKSTAT          /* 0xBF802770 */
  .extern CLKSTATCLR       /* 0xBF802774 */
  .extern CLKSTATSET       /* 0xBF802778 */
  .extern CLKSTATINV       /* 0xBF80277C */
  .extern OSCTUN           /* 0xBF802880 */
  .extern OSCTUNCLR        /* 0xBF802884 */
  .extern OSCTUNSET        /* 0xBF802888 */
  .extern OSCTUNINV        /* 0xBF80288C */
  .extern ANCFG            /* 0xBF802910 */
  .extern ANCFGCLR         /* 0xBF802914 */
  .extern ANCFGSET         /* 0xBF802918 */
  .extern ANCFGINV         /* 0xBF80291C */
  .extern HLVDCON          /* 0xBF802920 */
  .extern HLVDCONCLR       /* 0xBF802924 */
  .extern HLVDCONSET       /* 0xBF802928 */
  .extern HLVDCONINV       /* 0xBF80292C */
  .extern NVMCON           /* 0xBF802930 */
  .extern NVMCONCLR        /* 0xBF802934 */
  .extern NVMCONSET        /* 0xBF802938 */
  .extern NVMCONINV        /* 0xBF80293C */
  .extern NVMKEY           /* 0xBF802940 */
  .extern NVMKEYCLR        /* 0xBF802944 */
  .extern NVMKEYSET        /* 0xBF802948 */
  .extern NVMKEYINV        /* 0xBF80294C */
  .extern NVMADDR          /* 0xBF802950 */
  .extern NVMADDRCLR       /* 0xBF802954 */
  .extern NVMADDRSET       /* 0xBF802958 */
  .extern NVMADDRINV       /* 0xBF80295C */
  .extern NVMDATA0         /* 0xBF802960 */
  .extern NVMDATA0CLR      /* 0xBF802964 */
  .extern NVMDATA0SET      /* 0xBF802968 */
  .extern NVMDATA0INV      /* 0xBF80296C */
  .extern NVMDATA1         /* 0xBF802970 */
  .extern NVMDATA1CLR      /* 0xBF802974 */
  .extern NVMDATA1SET      /* 0xBF802978 */
  .extern NVMDATA1INV      /* 0xBF80297C */
  .extern NVMSRCADDR       /* 0xBF802980 */
  .extern NVMSRCADDRCLR    /* 0xBF802984 */
  .extern NVMSRCADDRSET    /* 0xBF802988 */
  .extern NVMSRCADDRINV    /* 0xBF80298C */
  .extern NVMPWP           /* 0xBF802990 */
  .extern NVMPWPCLR        /* 0xBF802994 */
  .extern NVMPWPSET        /* 0xBF802998 */
  .extern NVMPWPINV        /* 0xBF80299C */
  .extern NVMBWP           /* 0xBF8029A0 */
  .extern NVMBWPCLR        /* 0xBF8029A4 */
  .extern NVMBWPSET        /* 0xBF8029A8 */
  .extern NVMBWPINV        /* 0xBF8029AC */
  .extern RPCON            /* 0xBF802A00 */
  .extern RPCONCLR         /* 0xBF802A04 */
  .extern RPCONSET         /* 0xBF802A08 */
  .extern RPCONINV         /* 0xBF802A0C */
  .extern RPINR1           /* 0xBF802A20 */
  .extern RPINR1CLR        /* 0xBF802A24 */
  .extern RPINR1SET        /* 0xBF802A28 */
  .extern RPINR1INV        /* 0xBF802A2C */
  .extern RPINR2           /* 0xBF802A30 */
  .extern RPINR2CLR        /* 0xBF802A34 */
  .extern RPINR2SET        /* 0xBF802A38 */
  .extern RPINR2INV        /* 0xBF802A3C */
  .extern RPINR3           /* 0xBF802A40 */
  .extern RPINR3CLR        /* 0xBF802A44 */
  .extern RPINR3SET        /* 0xBF802A48 */
  .extern RPINR3INV        /* 0xBF802A4C */
  .extern RPINR5           /* 0xBF802A60 */
  .extern RPINR5CLR        /* 0xBF802A64 */
  .extern RPINR5SET        /* 0xBF802A68 */
  .extern RPINR5INV        /* 0xBF802A6C */
  .extern RPINR6           /* 0xBF802A70 */
  .extern RPINR6CLR        /* 0xBF802A74 */
  .extern RPINR6SET        /* 0xBF802A78 */
  .extern RPINR6INV        /* 0xBF802A7C */
  .extern RPINR7           /* 0xBF802A80 */
  .extern RPINR7CLR        /* 0xBF802A84 */
  .extern RPINR7SET        /* 0xBF802A88 */
  .extern RPINR7INV        /* 0xBF802A8C */
  .extern RPINR8           /* 0xBF802A90 */
  .extern RPINR8CLR        /* 0xBF802A94 */
  .extern RPINR8SET        /* 0xBF802A98 */
  .extern RPINR8INV        /* 0xBF802A9C */
  .extern RPINR9           /* 0xBF802AA0 */
  .extern RPINR9CLR        /* 0xBF802AA4 */
  .extern RPINR9SET        /* 0xBF802AA8 */
  .extern RPINR9INV        /* 0xBF802AAC */
  .extern RPINR10          /* 0xBF802AB0 */
  .extern RPINR10CLR       /* 0xBF802AB4 */
  .extern RPINR10SET       /* 0xBF802AB8 */
  .extern RPINR10INV       /* 0xBF802ABC */
  .extern RPINR11          /* 0xBF802AC0 */
  .extern RPINR11CLR       /* 0xBF802AC4 */
  .extern RPINR11SET       /* 0xBF802AC8 */
  .extern RPINR11INV       /* 0xBF802ACC */
  .extern RPINR12          /* 0xBF802AD0 */
  .extern RPINR12CLR       /* 0xBF802AD4 */
  .extern RPINR12SET       /* 0xBF802AD8 */
  .extern RPINR12INV       /* 0xBF802ADC */
  .extern RPOR0            /* 0xBF802B10 */
  .extern RPOR0CLR         /* 0xBF802B14 */
  .extern RPOR0SET         /* 0xBF802B18 */
  .extern RPOR0INV         /* 0xBF802B1C */
  .extern RPOR1            /* 0xBF802B20 */
  .extern RPOR1CLR         /* 0xBF802B24 */
  .extern RPOR1SET         /* 0xBF802B28 */
  .extern RPOR1INV         /* 0xBF802B2C */
  .extern RPOR2            /* 0xBF802B30 */
  .extern RPOR2CLR         /* 0xBF802B34 */
  .extern RPOR2SET         /* 0xBF802B38 */
  .extern RPOR2INV         /* 0xBF802B3C */
  .extern RPOR3            /* 0xBF802B40 */
  .extern RPOR3CLR         /* 0xBF802B44 */
  .extern RPOR3SET         /* 0xBF802B48 */
  .extern RPOR3INV         /* 0xBF802B4C */
  .extern RPOR4            /* 0xBF802B50 */
  .extern RPOR4CLR         /* 0xBF802B54 */
  .extern RPOR4SET         /* 0xBF802B58 */
  .extern RPOR4INV         /* 0xBF802B5C */
  .extern RPOR5            /* 0xBF802B60 */
  .extern RPOR5CLR         /* 0xBF802B64 */
  .extern RPOR5SET         /* 0xBF802B68 */
  .extern RPOR5INV         /* 0xBF802B6C */
  .extern ANSELA           /* 0xBF802BB0 */
  .extern ANSELACLR        /* 0xBF802BB4 */
  .extern ANSELASET        /* 0xBF802BB8 */
  .extern ANSELAINV        /* 0xBF802BBC */
  .extern TRISA            /* 0xBF802BC0 */
  .extern TRISACLR         /* 0xBF802BC4 */
  .extern TRISASET         /* 0xBF802BC8 */
  .extern TRISAINV         /* 0xBF802BCC */
  .extern PORTA            /* 0xBF802BD0 */
  .extern PORTACLR         /* 0xBF802BD4 */
  .extern PORTASET         /* 0xBF802BD8 */
  .extern PORTAINV         /* 0xBF802BDC */
  .extern LATA             /* 0xBF802BE0 */
  .extern LATACLR          /* 0xBF802BE4 */
  .extern LATASET          /* 0xBF802BE8 */
  .extern LATAINV          /* 0xBF802BEC */
  .extern ODCA             /* 0xBF802BF0 */
  .extern ODCACLR          /* 0xBF802BF4 */
  .extern ODCASET          /* 0xBF802BF8 */
  .extern ODCAINV          /* 0xBF802BFC */
  .extern CNPUA            /* 0xBF802C00 */
  .extern CNPUACLR         /* 0xBF802C04 */
  .extern CNPUASET         /* 0xBF802C08 */
  .extern CNPUAINV         /* 0xBF802C0C */
  .extern CNPDA            /* 0xBF802C10 */
  .extern CNPDACLR         /* 0xBF802C14 */
  .extern CNPDASET         /* 0xBF802C18 */
  .extern CNPDAINV         /* 0xBF802C1C */
  .extern CNCONA           /* 0xBF802C20 */
  .extern CNCONACLR        /* 0xBF802C24 */
  .extern CNCONASET        /* 0xBF802C28 */
  .extern CNCONAINV        /* 0xBF802C2C */
  .extern CNEN0A           /* 0xBF802C30 */
  .extern CNEN0ACLR        /* 0xBF802C34 */
  .extern CNEN0ASET        /* 0xBF802C38 */
  .extern CNEN0AINV        /* 0xBF802C3C */
  .extern CNSTATA          /* 0xBF802C40 */
  .extern CNSTATACLR       /* 0xBF802C44 */
  .extern CNSTATASET       /* 0xBF802C48 */
  .extern CNSTATAINV       /* 0xBF802C4C */
  .extern CNEN1A           /* 0xBF802C50 */
  .extern CNEN1ACLR        /* 0xBF802C54 */
  .extern CNEN1ASET        /* 0xBF802C58 */
  .extern CNEN1AINV        /* 0xBF802C5C */
  .extern CNFA             /* 0xBF802C60 */
  .extern CNFACLR          /* 0xBF802C64 */
  .extern CNFASET          /* 0xBF802C68 */
  .extern CNFAINV          /* 0xBF802C6C */
  .extern SR0A             /* 0xBF802C70 */
  .extern SR0ACLR          /* 0xBF802C74 */
  .extern SR0ASET          /* 0xBF802C78 */
  .extern SR0AINV          /* 0xBF802C7C */
  .extern SR1A             /* 0xBF802C80 */
  .extern SR1ACLR          /* 0xBF802C84 */
  .extern SR1ASET          /* 0xBF802C88 */
  .extern SR1AINV          /* 0xBF802C8C */
  .extern ANSELB           /* 0xBF802CB0 */
  .extern B                /* 0xBF802CB0 */
  .extern ANSELBCLR        /* 0xBF802CB4 */
  .extern BCLR             /* 0xBF802CB4 */
  .extern ANSELBSET        /* 0xBF802CB8 */
  .extern BSET             /* 0xBF802CB8 */
  .extern ANSELBINV        /* 0xBF802CBC */
  .extern BINV             /* 0xBF802CBC */
  .extern TRISB            /* 0xBF802CC0 */
  .extern TRISBCLR         /* 0xBF802CC4 */
  .extern TRISBSET         /* 0xBF802CC8 */
  .extern TRISBINV         /* 0xBF802CCC */
  .extern PORTB            /* 0xBF802CD0 */
  .extern PORTBCLR         /* 0xBF802CD4 */
  .extern PORTBSET         /* 0xBF802CD8 */
  .extern PORTBINV         /* 0xBF802CDC */
  .extern LATB             /* 0xBF802CE0 */
  .extern LATBCLR          /* 0xBF802CE4 */
  .extern LATBSET          /* 0xBF802CE8 */
  .extern LATBINV          /* 0xBF802CEC */
  .extern ODCB             /* 0xBF802CF0 */
  .extern ODCBCLR          /* 0xBF802CF4 */
  .extern ODCBSET          /* 0xBF802CF8 */
  .extern ODCBINV          /* 0xBF802CFC */
  .extern CNPUB            /* 0xBF802D00 */
  .extern CNPUBCLR         /* 0xBF802D04 */
  .extern CNPUBSET         /* 0xBF802D08 */
  .extern CNPUBINV         /* 0xBF802D0C */
  .extern CNPDB            /* 0xBF802D10 */
  .extern CNPDBCLR         /* 0xBF802D14 */
  .extern CNPDBSET         /* 0xBF802D18 */
  .extern CNPDBINV         /* 0xBF802D1C */
  .extern CNCONB           /* 0xBF802D20 */
  .extern CNCONBCLR        /* 0xBF802D24 */
  .extern CNCONBSET        /* 0xBF802D28 */
  .extern CNCONBINV        /* 0xBF802D2C */
  .extern CNEN0B           /* 0xBF802D30 */
  .extern CNEN0BCLR        /* 0xBF802D34 */
  .extern CNEN0BSET        /* 0xBF802D38 */
  .extern CNEN0BINV        /* 0xBF802D3C */
  .extern CNSTATB          /* 0xBF802D40 */
  .extern CNSTATBCLR       /* 0xBF802D44 */
  .extern CNSTATBSET       /* 0xBF802D48 */
  .extern CNSTATBINV       /* 0xBF802D4C */
  .extern CNEN1B           /* 0xBF802D50 */
  .extern CNEN1BCLR        /* 0xBF802D54 */
  .extern CNEN1BSET        /* 0xBF802D58 */
  .extern CNEN1BINV        /* 0xBF802D5C */
  .extern CNFB             /* 0xBF802D60 */
  .extern CNFBCLR          /* 0xBF802D64 */
  .extern CNFBSET          /* 0xBF802D68 */
  .extern CNFBINV          /* 0xBF802D6C */
  .extern SR0B             /* 0xBF802D70 */
  .extern SR0BCLR          /* 0xBF802D74 */
  .extern SR0BSET          /* 0xBF802D78 */
  .extern SR0BINV          /* 0xBF802D7C */
  .extern SR1B             /* 0xBF802D80 */
  .extern SR1BCLR          /* 0xBF802D84 */
  .extern SR1BSET          /* 0xBF802D88 */
  .extern SR1BINV          /* 0xBF802D8C */
  .extern ANSELC           /* 0xBF802DB0 */
  .extern ANSELCCLR        /* 0xBF802DB4 */
  .extern ANSELCSET        /* 0xBF802DB8 */
  .extern ANSELCINV        /* 0xBF802DBC */
  .extern TRISC            /* 0xBF802DC0 */
  .extern TRISCCLR         /* 0xBF802DC4 */
  .extern TRISCSET         /* 0xBF802DC8 */
  .extern TRISCINV         /* 0xBF802DCC */
  .extern PORTC            /* 0xBF802DD0 */
  .extern PORTCCLR         /* 0xBF802DD4 */
  .extern PORTCSET         /* 0xBF802DD8 */
  .extern PORTCINV         /* 0xBF802DDC */
  .extern LATC             /* 0xBF802DE0 */
  .extern LATCCLR          /* 0xBF802DE4 */
  .extern LATCSET          /* 0xBF802DE8 */
  .extern LATCINV          /* 0xBF802DEC */
  .extern ODCC             /* 0xBF802DF0 */
  .extern ODCCCLR          /* 0xBF802DF4 */
  .extern ODCCSET          /* 0xBF802DF8 */
  .extern ODCCINV          /* 0xBF802DFC */
  .extern CNPUC            /* 0xBF802E00 */
  .extern CNPUCCLR         /* 0xBF802E04 */
  .extern CNPUCSET         /* 0xBF802E08 */
  .extern CNPUCINV         /* 0xBF802E0C */
  .extern CNPDC            /* 0xBF802E10 */
  .extern CNPDCCLR         /* 0xBF802E14 */
  .extern CNPDCSET         /* 0xBF802E18 */
  .extern CNPDCINV         /* 0xBF802E1C */
  .extern CNCONC           /* 0xBF802E20 */
  .extern CNCONCCLR        /* 0xBF802E24 */
  .extern CNCONCSET        /* 0xBF802E28 */
  .extern CNCONCINV        /* 0xBF802E2C */
  .extern CNEN0C           /* 0xBF802E30 */
  .extern CNEN0CCLR        /* 0xBF802E34 */
  .extern CNEN0CSET        /* 0xBF802E38 */
  .extern CNEN0CINV        /* 0xBF802E3C */
  .extern CNSTATC          /* 0xBF802E40 */
  .extern CNSTATCCLR       /* 0xBF802E44 */
  .extern CNSTATCSET       /* 0xBF802E48 */
  .extern CNSTATCINV       /* 0xBF802E4C */
  .extern CNEN1C           /* 0xBF802E50 */
  .extern CNEN1CCLR        /* 0xBF802E54 */
  .extern CNEN1CSET        /* 0xBF802E58 */
  .extern CNEN1CINV        /* 0xBF802E5C */
  .extern CNFC             /* 0xBF802E60 */
  .extern CNFCCLR          /* 0xBF802E64 */
  .extern CNFCSET          /* 0xBF802E68 */
  .extern CNFCINV          /* 0xBF802E6C */
  .extern SR0C             /* 0xBF802E70 */
  .extern SR0CCLR          /* 0xBF802E74 */
  .extern SR0CSET          /* 0xBF802E78 */
  .extern SR0CINV          /* 0xBF802E7C */
  .extern SR1C             /* 0xBF802E80 */
  .extern SR1CCLR          /* 0xBF802E84 */
  .extern SR1CSET          /* 0xBF802E88 */
  .extern SR1CINV          /* 0xBF802E8C */
  .extern PMDCON           /* 0xBF8035B0 */
  .extern PMDCONCLR        /* 0xBF8035B4 */
  .extern PMDCONSET        /* 0xBF8035B8 */
  .extern PMDCONINV        /* 0xBF8035BC */
  .extern PMD1             /* 0xBF8035C0 */
  .extern PMD1CLR          /* 0xBF8035C4 */
  .extern PMD1SET          /* 0xBF8035C8 */
  .extern PMD1INV          /* 0xBF8035CC */
  .extern PMD2             /* 0xBF8035D0 */
  .extern PMD2CLR          /* 0xBF8035D4 */
  .extern PMD2SET          /* 0xBF8035D8 */
  .extern PMD2INV          /* 0xBF8035DC */
  .extern PMD3             /* 0xBF8035E0 */
  .extern PMD3CLR          /* 0xBF8035E4 */
  .extern PMD3SET          /* 0xBF8035E8 */
  .extern PMD3INV          /* 0xBF8035EC */
  .extern PMD4             /* 0xBF8035F0 */
  .extern PMD4CLR          /* 0xBF8035F4 */
  .extern PMD4SET          /* 0xBF8035F8 */
  .extern PMD4INV          /* 0xBF8035FC */
  .extern PMD5             /* 0xBF803600 */
  .extern PMD5CLR          /* 0xBF803604 */
  .extern PMD5SET          /* 0xBF803608 */
  .extern PMD5INV          /* 0xBF80360C */
  .extern PMD6             /* 0xBF803610 */
  .extern PMD6CLR          /* 0xBF803614 */
  .extern PMD6SET          /* 0xBF803618 */
  .extern PMD6INV          /* 0xBF80361C */
  .extern PMD7             /* 0xBF803620 */
  .extern PMD7CLR          /* 0xBF803624 */
  .extern PMD7SET          /* 0xBF803628 */
  .extern PMD7INV          /* 0xBF80362C */
  .extern CFGCON           /* 0xBF803640 */
  .extern CFGCONCLR        /* 0xBF803644 */
  .extern CFGCONSET        /* 0xBF803648 */
  .extern CFGCONINV        /* 0xBF80364C */
  .extern DEVID            /* 0xBF803660 */
  .extern DEVIDCLR         /* 0xBF803664 */
  .extern DEVIDSET         /* 0xBF803668 */
  .extern DEVIDINV         /* 0xBF80366C */
  .extern SYSKEY           /* 0xBF803670 */
  .extern SYSKEYCLR        /* 0xBF803674 */
  .extern SYSKEYSET        /* 0xBF803678 */
  .extern SYSKEYINV        /* 0xBF80367C */
  .extern WDTCON           /* 0xBF803990 */
  .extern WDTCONCLR        /* 0xBF803994 */
  .extern WDTCONSET        /* 0xBF803998 */
  .extern WDTCONINV        /* 0xBF80399C */
  .extern T1CON            /* 0xBF808000 */
  .extern T1CONCLR         /* 0xBF808004 */
  .extern T1CONSET         /* 0xBF808008 */
  .extern T1CONINV         /* 0xBF80800C */
  .extern TMR1             /* 0xBF808010 */
  .extern TMR1CLR          /* 0xBF808014 */
  .extern TMR1SET          /* 0xBF808018 */
  .extern TMR1INV          /* 0xBF80801C */
  .extern PR1              /* 0xBF808020 */
  .extern PR1CLR           /* 0xBF808024 */
  .extern PR1SET           /* 0xBF808028 */
  .extern PR1INV           /* 0xBF80802C */
