Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm036.h
  .extern IPC20            /* 0xBF80F280 */
  .extern IPC20CLR         /* 0xBF80F284 */
  .extern IPC20SET         /* 0xBF80F288 */
  .extern IPC20INV         /* 0xBF80F28C */
  .extern IPC21            /* 0xBF80F290 */
  .extern IPC21CLR         /* 0xBF80F294 */
  .extern IPC21SET         /* 0xBF80F298 */
  .extern IPC21INV         /* 0xBF80F29C */
  .extern IPC22            /* 0xBF80F2A0 */
  .extern IPC22CLR         /* 0xBF80F2A4 */
  .extern IPC22SET         /* 0xBF80F2A8 */
  .extern IPC22INV         /* 0xBF80F2AC */
  .extern IPC23            /* 0xBF80F2B0 */
  .extern IPC23CLR         /* 0xBF80F2B4 */
  .extern IPC23SET         /* 0xBF80F2B8 */
  .extern IPC23INV         /* 0xBF80F2BC */
  .extern IPC24            /* 0xBF80F2C0 */
  .extern IPC24CLR         /* 0xBF80F2C4 */
  .extern IPC24SET         /* 0xBF80F2C8 */
  .extern IPC24INV         /* 0xBF80F2CC */
  .extern IPC25            /* 0xBF80F2D0 */
  .extern IPC25CLR         /* 0xBF80F2D4 */
  .extern IPC25SET         /* 0xBF80F2D8 */
  .extern IPC25INV         /* 0xBF80F2DC */
  .extern UDID1            /* 0xBFC41840 */
  .extern UDID2            /* 0xBFC41844 */
  .extern UDID3            /* 0xBFC41848 */
  .extern UDID4            /* 0xBFC4184C */
  .extern UDID5            /* 0xBFC41850 */
  .extern FDEVOPT          /* 0xBFC017C4 */
  .extern FICD             /* 0xBFC017C8 */
  .extern FPOR             /* 0xBFC017CC */
  .extern FWDT             /* 0xBFC017D0 */
  .extern FOSCSEL          /* 0xBFC017D4 */
  .extern FSEC             /* 0xBFC017D8 */
  .extern AFDEVOPT         /* 0xBFC01744 */
  .extern AFICD            /* 0xBFC01748 */
  .extern AFPOR            /* 0xBFC0174C */
  .extern AFWDT            /* 0xBFC01750 */
  .extern AFOSCSEL         /* 0xBFC01754 */
  .extern AFSEC            /* 0xBFC01758 */
#else
#error Unknown language!
#endif

#define _RTCCON1_OUTSEL_POSITION                 0x00000004
#define _RTCCON1_OUTSEL_MASK                     0x00000070
#define _RTCCON1_OUTSEL_LENGTH                   0x00000003

#define _RTCCON1_RTCOE_POSITION                  0x00000007
#define _RTCCON1_RTCOE_MASK                      0x00000080
#define _RTCCON1_RTCOE_LENGTH                    0x00000001

#define _RTCCON1_WRLOCK_POSITION                 0x0000000B
#define _RTCCON1_WRLOCK_MASK                     0x00000800
#define _RTCCON1_WRLOCK_LENGTH                   0x00000001

#define _RTCCON1_ON_POSITION                     0x0000000F
#define _RTCCON1_ON_MASK                         0x00008000
#define _RTCCON1_ON_LENGTH                       0x00000001

#define _RTCCON1_ALMRPT_POSITION                 0x00000010
#define _RTCCON1_ALMRPT_MASK                     0x00FF0000
#define _RTCCON1_ALMRPT_LENGTH                   0x00000008

#define _RTCCON1_AMASK_POSITION                  0x00000018
#define _RTCCON1_AMASK_MASK                      0x0F000000
#define _RTCCON1_AMASK_LENGTH                    0x00000004

#define _RTCCON1_CHIME_POSITION                  0x0000001E
#define _RTCCON1_CHIME_MASK                      0x40000000
#define _RTCCON1_CHIME_LENGTH                    0x00000001

#define _RTCCON1_ALRMEN_POSITION                 0x0000001F
#define _RTCCON1_ALRMEN_MASK                     0x80000000
#define _RTCCON1_ALRMEN_LENGTH                   0x00000001

#define _RTCCON2_CLKSEL_POSITION                 0x00000000
#define _RTCCON2_CLKSEL_MASK                     0x00000003
#define _RTCCON2_CLKSEL_LENGTH                   0x00000002

#define _RTCCON2_FDIV_POSITION                   0x0000000B
#define _RTCCON2_FDIV_MASK                       0x0000F800
#define _RTCCON2_FDIV_LENGTH                     0x00000005

#define _RTCCON2_DIV_POSITION                    0x00000010
#define _RTCCON2_DIV_MASK                        0xFFFF0000
#define _RTCCON2_DIV_LENGTH                      0x00000010

#define _RTCSTAT_HALFSEC_POSITION                0x00000000
#define _RTCSTAT_HALFSEC_MASK                    0x00000001
#define _RTCSTAT_HALFSEC_LENGTH                  0x00000001

#define _RTCSTAT_ALMSYNC_POSITION                0x00000001
#define _RTCSTAT_ALMSYNC_MASK                    0x00000002
#define _RTCSTAT_ALMSYNC_LENGTH                  0x00000001

#define _RTCSTAT_SYNC_POSITION                   0x00000002
#define _RTCSTAT_SYNC_MASK                       0x00000004
#define _RTCSTAT_SYNC_LENGTH                     0x00000001

#define _RTCSTAT_ALMEVT_POSITION                 0x00000005
#define _RTCSTAT_ALMEVT_MASK                     0x00000020
#define _RTCSTAT_ALMEVT_LENGTH                   0x00000001

#define _RTCTIME_SECONE_POSITION                 0x00000008
#define _RTCTIME_SECONE_MASK                     0x00000F00
#define _RTCTIME_SECONE_LENGTH                   0x00000004

#define _RTCTIME_SECTEN_POSITION                 0x0000000C
#define _RTCTIME_SECTEN_MASK                     0x00007000
#define _RTCTIME_SECTEN_LENGTH                   0x00000003

#define _RTCTIME_MINONE_POSITION                 0x00000010
#define _RTCTIME_MINONE_MASK                     0x000F0000
#define _RTCTIME_MINONE_LENGTH                   0x00000004

#define _RTCTIME_MINTEN_POSITION                 0x00000014
#define _RTCTIME_MINTEN_MASK                     0x00700000
#define _RTCTIME_MINTEN_LENGTH                   0x00000003

#define _RTCTIME_HRONE_POSITION                  0x00000018
#define _RTCTIME_HRONE_MASK                      0x0F000000
#define _RTCTIME_HRONE_LENGTH                    0x00000004

#define _RTCTIME_HRTEN_POSITION                  0x0000001C
#define _RTCTIME_HRTEN_MASK                      0x70000000
#define _RTCTIME_HRTEN_LENGTH                    0x00000003

#define _RTCDATE_WDAY_POSITION                   0x00000000
#define _RTCDATE_WDAY_MASK                       0x00000007
#define _RTCDATE_WDAY_LENGTH                     0x00000003

#define _RTCDATE_DAYONE_POSITION                 0x00000008
#define _RTCDATE_DAYONE_MASK                     0x00000F00
#define _RTCDATE_DAYONE_LENGTH                   0x00000004

#define _RTCDATE_DAYTEN_POSITION                 0x0000000C
#define _RTCDATE_DAYTEN_MASK                     0x00003000
#define _RTCDATE_DAYTEN_LENGTH                   0x00000002

