Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm036.h
#define _CCP3CON3_POLBDF_POSITION                0x00000014
#define _CCP3CON3_POLBDF_MASK                    0x00100000
#define _CCP3CON3_POLBDF_LENGTH                  0x00000001

#define _CCP3CON3_POLACE_POSITION                0x00000015
#define _CCP3CON3_POLACE_MASK                    0x00200000
#define _CCP3CON3_POLACE_LENGTH                  0x00000001

#define _CCP3CON3_OUTM_POSITION                  0x00000018
#define _CCP3CON3_OUTM_MASK                      0x07000000
#define _CCP3CON3_OUTM_LENGTH                    0x00000003

#define _CCP3CON3_OSCNT_POSITION                 0x0000001C
#define _CCP3CON3_OSCNT_MASK                     0x70000000
#define _CCP3CON3_OSCNT_LENGTH                   0x00000003

#define _CCP3CON3_OETRIG_POSITION                0x0000001F
#define _CCP3CON3_OETRIG_MASK                    0x80000000
#define _CCP3CON3_OETRIG_LENGTH                  0x00000001

#define _CCP3STAT_ICBNE_POSITION                 0x00000000
#define _CCP3STAT_ICBNE_MASK                     0x00000001
#define _CCP3STAT_ICBNE_LENGTH                   0x00000001

#define _CCP3STAT_ICOV_POSITION                  0x00000001
#define _CCP3STAT_ICOV_MASK                      0x00000002
#define _CCP3STAT_ICOV_LENGTH                    0x00000001

#define _CCP3STAT_ICDIS_POSITION                 0x00000002
#define _CCP3STAT_ICDIS_MASK                     0x00000004
#define _CCP3STAT_ICDIS_LENGTH                   0x00000001

#define _CCP3STAT_SCEVT_POSITION                 0x00000003
#define _CCP3STAT_SCEVT_MASK                     0x00000008
#define _CCP3STAT_SCEVT_LENGTH                   0x00000001

#define _CCP3STAT_ASEVT_POSITION                 0x00000004
#define _CCP3STAT_ASEVT_MASK                     0x00000010
#define _CCP3STAT_ASEVT_LENGTH                   0x00000001

#define _CCP3STAT_TRCLR_POSITION                 0x00000005
#define _CCP3STAT_TRCLR_MASK                     0x00000020
#define _CCP3STAT_TRCLR_LENGTH                   0x00000001

#define _CCP3STAT_TRSET_POSITION                 0x00000006
#define _CCP3STAT_TRSET_MASK                     0x00000040
#define _CCP3STAT_TRSET_LENGTH                   0x00000001

#define _CCP3STAT_CCPTRIG_POSITION               0x00000007
#define _CCP3STAT_CCPTRIG_MASK                   0x00000080
#define _CCP3STAT_CCPTRIG_LENGTH                 0x00000001

#define _CCP3STAT_ICGARM_POSITION                0x0000000A
#define _CCP3STAT_ICGARM_MASK                    0x00000400
#define _CCP3STAT_ICGARM_LENGTH                  0x00000001

#define _CCP3STAT_RAWIP_POSITION                 0x00000010
#define _CCP3STAT_RAWIP_MASK                     0x00010000
#define _CCP3STAT_RAWIP_LENGTH                   0x00000001

#define _CCP3STAT_RBWIP_POSITION                 0x00000011
#define _CCP3STAT_RBWIP_MASK                     0x00020000
#define _CCP3STAT_RBWIP_LENGTH                   0x00000001

#define _CCP3STAT_TMRLWIP_POSITION               0x00000012
#define _CCP3STAT_TMRLWIP_MASK                   0x00040000
#define _CCP3STAT_TMRLWIP_LENGTH                 0x00000001

#define _CCP3STAT_TMRHWIP_POSITION               0x00000013
#define _CCP3STAT_TMRHWIP_MASK                   0x00080000
#define _CCP3STAT_TMRHWIP_LENGTH                 0x00000001

#define _CCP3STAT_PRLWIP_POSITION                0x00000014
#define _CCP3STAT_PRLWIP_MASK                    0x00100000
#define _CCP3STAT_PRLWIP_LENGTH                  0x00000001

#define _CCP3TMR_TMRL_POSITION                   0x00000000
#define _CCP3TMR_TMRL_MASK                       0x0000FFFF
#define _CCP3TMR_TMRL_LENGTH                     0x00000010

#define _CCP3TMR_TMRH_POSITION                   0x00000010
#define _CCP3TMR_TMRH_MASK                       0xFFFF0000
#define _CCP3TMR_TMRH_LENGTH                     0x00000010

#define _CCP3TMR_TMR_POSITION                    0x00000000
#define _CCP3TMR_TMR_MASK                        0xFFFFFFFF
#define _CCP3TMR_TMR_LENGTH                      0x00000020

#define _CCP3PR_PRL_POSITION                     0x00000000
#define _CCP3PR_PRL_MASK                         0x0000FFFF
#define _CCP3PR_PRL_LENGTH                       0x00000010

#define _CCP3PR_PRH_POSITION                     0x00000010
#define _CCP3PR_PRH_MASK                         0xFFFF0000
#define _CCP3PR_PRH_LENGTH                       0x00000010

#define _CCP3PR_PR_POSITION                      0x00000000
#define _CCP3PR_PR_MASK                          0xFFFFFFFF
#define _CCP3PR_PR_LENGTH                        0x00000020

#define _CCP3RA_CMPA_POSITION                    0x00000000
#define _CCP3RA_CMPA_MASK                        0x0000FFFF
#define _CCP3RA_CMPA_LENGTH                      0x00000010

#define _CCP3RB_CMPB_POSITION                    0x00000000
#define _CCP3RB_CMPB_MASK                        0x0000FFFF
#define _CCP3RB_CMPB_LENGTH                      0x00000010

#define _CCP3BUF_BUFL_POSITION                   0x00000000
#define _CCP3BUF_BUFL_MASK                       0x0000FFFF
#define _CCP3BUF_BUFL_LENGTH                     0x00000010

#define _CCP3BUF_BUFH_POSITION                   0x00000010
#define _CCP3BUF_BUFH_MASK                       0xFFFF0000
#define _CCP3BUF_BUFH_LENGTH                     0x00000010

#define _CCP3BUF_BUF_POSITION                    0x00000000
#define _CCP3BUF_BUF_MASK                        0xFFFFFFFF
#define _CCP3BUF_BUF_LENGTH                      0x00000020

#define _CCP4CON1_MOD_POSITION                   0x00000000
#define _CCP4CON1_MOD_MASK                       0x0000000F
#define _CCP4CON1_MOD_LENGTH                     0x00000004

#define _CCP4CON1_CCSEL_POSITION                 0x00000004
#define _CCP4CON1_CCSEL_MASK                     0x00000010
#define _CCP4CON1_CCSEL_LENGTH                   0x00000001

#define _CCP4CON1_T32_POSITION                   0x00000005
#define _CCP4CON1_T32_MASK                       0x00000020
#define _CCP4CON1_T32_LENGTH                     0x00000001

#define _CCP4CON1_TMRPS_POSITION                 0x00000006
#define _CCP4CON1_TMRPS_MASK                     0x000000C0
#define _CCP4CON1_TMRPS_LENGTH                   0x00000002

#define _CCP4CON1_CLKSEL_POSITION                0x00000008
#define _CCP4CON1_CLKSEL_MASK                    0x00000700
#define _CCP4CON1_CLKSEL_LENGTH                  0x00000003

