Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm036.h
#define _AD1CSS_CSS1_POSITION                    0x00000001
#define _AD1CSS_CSS1_MASK                        0x00000002
#define _AD1CSS_CSS1_LENGTH                      0x00000001

#define _AD1CSS_CSS2_POSITION                    0x00000002
#define _AD1CSS_CSS2_MASK                        0x00000004
#define _AD1CSS_CSS2_LENGTH                      0x00000001

#define _AD1CSS_CSS3_POSITION                    0x00000003
#define _AD1CSS_CSS3_MASK                        0x00000008
#define _AD1CSS_CSS3_LENGTH                      0x00000001

#define _AD1CSS_CSS4_POSITION                    0x00000004
#define _AD1CSS_CSS4_MASK                        0x00000010
#define _AD1CSS_CSS4_LENGTH                      0x00000001

#define _AD1CSS_CSS5_POSITION                    0x00000005
#define _AD1CSS_CSS5_MASK                        0x00000020
#define _AD1CSS_CSS5_LENGTH                      0x00000001

#define _AD1CSS_CSS6_POSITION                    0x00000006
#define _AD1CSS_CSS6_MASK                        0x00000040
#define _AD1CSS_CSS6_LENGTH                      0x00000001

#define _AD1CSS_CSS7_POSITION                    0x00000007
#define _AD1CSS_CSS7_MASK                        0x00000080
#define _AD1CSS_CSS7_LENGTH                      0x00000001

#define _AD1CSS_CSS8_POSITION                    0x00000008
#define _AD1CSS_CSS8_MASK                        0x00000100
#define _AD1CSS_CSS8_LENGTH                      0x00000001

#define _AD1CSS_CSS9_POSITION                    0x00000009
#define _AD1CSS_CSS9_MASK                        0x00000200
#define _AD1CSS_CSS9_LENGTH                      0x00000001

#define _AD1CSS_CSS10_POSITION                   0x0000000A
#define _AD1CSS_CSS10_MASK                       0x00000400
#define _AD1CSS_CSS10_LENGTH                     0x00000001

#define _AD1CSS_CSS11_POSITION                   0x0000000B
#define _AD1CSS_CSS11_MASK                       0x00000800
#define _AD1CSS_CSS11_LENGTH                     0x00000001

#define _AD1CSS_CSS12_POSITION                   0x0000000C
#define _AD1CSS_CSS12_MASK                       0x00001000
#define _AD1CSS_CSS12_LENGTH                     0x00000001

#define _AD1CSS_CSS13_POSITION                   0x0000000D
#define _AD1CSS_CSS13_MASK                       0x00002000
#define _AD1CSS_CSS13_LENGTH                     0x00000001

#define _AD1CSS_CSS14_POSITION                   0x0000000E
#define _AD1CSS_CSS14_MASK                       0x00004000
#define _AD1CSS_CSS14_LENGTH                     0x00000001

#define _AD1CSS_CSS15_POSITION                   0x0000000F
#define _AD1CSS_CSS15_MASK                       0x00008000
#define _AD1CSS_CSS15_LENGTH                     0x00000001

#define _AD1CSS_CSS16_POSITION                   0x00000010
#define _AD1CSS_CSS16_MASK                       0x00010000
#define _AD1CSS_CSS16_LENGTH                     0x00000001

#define _AD1CSS_CSS17_POSITION                   0x00000011
#define _AD1CSS_CSS17_MASK                       0x00020000
#define _AD1CSS_CSS17_LENGTH                     0x00000001

#define _AD1CSS_CSS18_POSITION                   0x00000012
#define _AD1CSS_CSS18_MASK                       0x00040000
#define _AD1CSS_CSS18_LENGTH                     0x00000001

#define _AD1CSS_CSS19_POSITION                   0x00000013
#define _AD1CSS_CSS19_MASK                       0x00080000
#define _AD1CSS_CSS19_LENGTH                     0x00000001

#define _AD1CSS_CSS20_POSITION                   0x00000014
#define _AD1CSS_CSS20_MASK                       0x00100000
#define _AD1CSS_CSS20_LENGTH                     0x00000001

#define _AD1CSS_CSS21_POSITION                   0x00000015
#define _AD1CSS_CSS21_MASK                       0x00200000
#define _AD1CSS_CSS21_LENGTH                     0x00000001

#define _AD1CSS_CSS22_POSITION                   0x00000016
#define _AD1CSS_CSS22_MASK                       0x00400000
#define _AD1CSS_CSS22_LENGTH                     0x00000001

#define _AD1CSS_CSS23_POSITION                   0x00000017
#define _AD1CSS_CSS23_MASK                       0x00800000
#define _AD1CSS_CSS23_LENGTH                     0x00000001

#define _AD1CSS_CSS24_POSITION                   0x00000018
#define _AD1CSS_CSS24_MASK                       0x01000000
#define _AD1CSS_CSS24_LENGTH                     0x00000001

#define _AD1CSS_CSS25_POSITION                   0x00000019
#define _AD1CSS_CSS25_MASK                       0x02000000
#define _AD1CSS_CSS25_LENGTH                     0x00000001

#define _AD1CSS_CSS26_POSITION                   0x0000001A
#define _AD1CSS_CSS26_MASK                       0x04000000
#define _AD1CSS_CSS26_LENGTH                     0x00000001

#define _AD1CSS_CSS27_POSITION                   0x0000001B
#define _AD1CSS_CSS27_MASK                       0x08000000
#define _AD1CSS_CSS27_LENGTH                     0x00000001

#define _AD1CSS_CSS28_POSITION                   0x0000001C
#define _AD1CSS_CSS28_MASK                       0x10000000
#define _AD1CSS_CSS28_LENGTH                     0x00000001

#define _AD1CSS_CSS29_POSITION                   0x0000001D
#define _AD1CSS_CSS29_MASK                       0x20000000
#define _AD1CSS_CSS29_LENGTH                     0x00000001

#define _AD1CSS_CSS30_POSITION                   0x0000001E
#define _AD1CSS_CSS30_MASK                       0x40000000
#define _AD1CSS_CSS30_LENGTH                     0x00000001

#define _AD1CSS_CSS31_POSITION                   0x0000001F
#define _AD1CSS_CSS31_MASK                       0x80000000
#define _AD1CSS_CSS31_LENGTH                     0x00000001

#define _AD1CON5_CM_POSITION                     0x00000000
#define _AD1CON5_CM_MASK                         0x00000003
#define _AD1CON5_CM_LENGTH                       0x00000002

#define _AD1CON5_WM_POSITION                     0x00000002
#define _AD1CON5_WM_MASK                         0x0000000C
#define _AD1CON5_WM_LENGTH                       0x00000002

#define _AD1CON5_ASINT_POSITION                  0x00000008
#define _AD1CON5_ASINT_MASK                      0x00000300
#define _AD1CON5_ASINT_LENGTH                    0x00000002

#define _AD1CON5_BGREQ_POSITION                  0x0000000C
#define _AD1CON5_BGREQ_MASK                      0x00001000
#define _AD1CON5_BGREQ_LENGTH                    0x00000001

