Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm036.h
#define _IFS2_CCP4IF_POSITION                    0x00000010
#define _IFS2_CCP4IF_MASK                        0x00010000
#define _IFS2_CCP4IF_LENGTH                      0x00000001

#define _IFS2_CCT4IF_POSITION                    0x00000011
#define _IFS2_CCT4IF_MASK                        0x00020000
#define _IFS2_CCT4IF_LENGTH                      0x00000001

#define _IFS2_CCP5IF_POSITION                    0x00000012
#define _IFS2_CCP5IF_MASK                        0x00040000
#define _IFS2_CCP5IF_LENGTH                      0x00000001

#define _IFS2_CCT5IF_POSITION                    0x00000013
#define _IFS2_CCT5IF_MASK                        0x00080000
#define _IFS2_CCT5IF_LENGTH                      0x00000001

#define _IFS2_CCP6IF_POSITION                    0x00000014
#define _IFS2_CCP6IF_MASK                        0x00100000
#define _IFS2_CCP6IF_LENGTH                      0x00000001

#define _IFS2_CCT6IF_POSITION                    0x00000015
#define _IFS2_CCT6IF_MASK                        0x00200000
#define _IFS2_CCT6IF_LENGTH                      0x00000001

#define _IFS2_CCP7IF_POSITION                    0x00000016
#define _IFS2_CCP7IF_MASK                        0x00400000
#define _IFS2_CCP7IF_LENGTH                      0x00000001

#define _IFS2_CCT7IF_POSITION                    0x00000017
#define _IFS2_CCT7IF_MASK                        0x00800000
#define _IFS2_CCT7IF_LENGTH                      0x00000001

#define _IFS2_CCP8IF_POSITION                    0x00000018
#define _IFS2_CCP8IF_MASK                        0x01000000
#define _IFS2_CCP8IF_LENGTH                      0x00000001

#define _IFS2_CCT8IF_POSITION                    0x00000019
#define _IFS2_CCT8IF_MASK                        0x02000000
#define _IFS2_CCT8IF_LENGTH                      0x00000001

#define _IFS2_CCP9IF_POSITION                    0x0000001A
#define _IFS2_CCP9IF_MASK                        0x04000000
#define _IFS2_CCP9IF_LENGTH                      0x00000001

#define _IFS2_CCT9IF_POSITION                    0x0000001B
#define _IFS2_CCT9IF_MASK                        0x08000000
#define _IFS2_CCT9IF_LENGTH                      0x00000001

#define _IFS2_FSTIF_POSITION                     0x0000001C
#define _IFS2_FSTIF_MASK                         0x10000000
#define _IFS2_FSTIF_LENGTH                       0x00000001

#define _IFS2_NVMIF_POSITION                     0x0000001E
#define _IFS2_NVMIF_MASK                         0x40000000
#define _IFS2_NVMIF_LENGTH                       0x00000001

#define _IFS2_CPCIF_POSITION                     0x0000001F
#define _IFS2_CPCIF_MASK                         0x80000000
#define _IFS2_CPCIF_LENGTH                       0x00000001

#define _IFS3_ECCBEIF_POSITION                   0x00000001
#define _IFS3_ECCBEIF_MASK                       0x00000002
#define _IFS3_ECCBEIF_LENGTH                     0x00000001

#define _IFS3_DMA0IF_POSITION                    0x00000002
#define _IFS3_DMA0IF_MASK                        0x00000004
#define _IFS3_DMA0IF_LENGTH                      0x00000001

#define _IFS3_DMA1IF_POSITION                    0x00000003
#define _IFS3_DMA1IF_MASK                        0x00000008
#define _IFS3_DMA1IF_LENGTH                      0x00000001

#define _IFS3_DMA2IF_POSITION                    0x00000004
#define _IFS3_DMA2IF_MASK                        0x00000010
#define _IFS3_DMA2IF_LENGTH                      0x00000001

#define _IFS3_DMA3IF_POSITION                    0x00000005
#define _IFS3_DMA3IF_MASK                        0x00000020
#define _IFS3_DMA3IF_LENGTH                      0x00000001

#define _IEC0_CTIE_POSITION                      0x00000000
#define _IEC0_CTIE_MASK                          0x00000001
#define _IEC0_CTIE_LENGTH                        0x00000001

#define _IEC0_CS0IE_POSITION                     0x00000001
#define _IEC0_CS0IE_MASK                         0x00000002
#define _IEC0_CS0IE_LENGTH                       0x00000001

#define _IEC0_CS1IE_POSITION                     0x00000002
#define _IEC0_CS1IE_MASK                         0x00000004
#define _IEC0_CS1IE_LENGTH                       0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000003
#define _IEC0_INT0IE_MASK                        0x00000008
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_INT1IE_POSITION                    0x00000004
#define _IEC0_INT1IE_MASK                        0x00000010
#define _IEC0_INT1IE_LENGTH                      0x00000001

#define _IEC0_INT2IE_POSITION                    0x00000005
#define _IEC0_INT2IE_MASK                        0x00000020
#define _IEC0_INT2IE_LENGTH                      0x00000001

#define _IEC0_INT3IE_POSITION                    0x00000006
#define _IEC0_INT3IE_MASK                        0x00000040
#define _IEC0_INT3IE_LENGTH                      0x00000001

#define _IEC0_INT4IE_POSITION                    0x00000007
#define _IEC0_INT4IE_MASK                        0x00000080
#define _IEC0_INT4IE_LENGTH                      0x00000001

#define _IEC0_CNAIE_POSITION                     0x00000008
#define _IEC0_CNAIE_MASK                         0x00000100
#define _IEC0_CNAIE_LENGTH                       0x00000001

#define _IEC0_CNBIE_POSITION                     0x00000009
#define _IEC0_CNBIE_MASK                         0x00000200
#define _IEC0_CNBIE_LENGTH                       0x00000001

#define _IEC0_CNCIE_POSITION                     0x0000000A
#define _IEC0_CNCIE_MASK                         0x00000400
#define _IEC0_CNCIE_LENGTH                       0x00000001

#define _IEC0_CNDIE_POSITION                     0x0000000B
#define _IEC0_CNDIE_MASK                         0x00000800
#define _IEC0_CNDIE_LENGTH                       0x00000001

#define _IEC0_T1IE_POSITION                      0x00000011
#define _IEC0_T1IE_MASK                          0x00020000
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_T2IE_POSITION                      0x00000012
#define _IEC0_T2IE_MASK                          0x00040000
#define _IEC0_T2IE_LENGTH                        0x00000001

#define _IEC0_T3IE_POSITION                      0x00000013
#define _IEC0_T3IE_MASK                          0x00080000
#define _IEC0_T3IE_LENGTH                        0x00000001

#define _IEC0_CMP1IE_POSITION                    0x00000017
#define _IEC0_CMP1IE_MASK                        0x00800000
#define _IEC0_CMP1IE_LENGTH                      0x00000001

#define _IEC0_CMP2IE_POSITION                    0x00000018
#define _IEC0_CMP2IE_MASK                        0x01000000
#define _IEC0_CMP2IE_LENGTH                      0x00000001

#define _IEC0_CMP3IE_POSITION                    0x00000019
#define _IEC0_CMP3IE_MASK                        0x02000000
#define _IEC0_CMP3IE_LENGTH                      0x00000001

