Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/include/proc/p32mm0064gpm036.h
#define _IEC2_CCP1IE_POSITION                    0x0000000A
#define _IEC2_CCP1IE_MASK                        0x00000400
#define _IEC2_CCP1IE_LENGTH                      0x00000001

#define _IEC2_CCT1IE_POSITION                    0x0000000B
#define _IEC2_CCT1IE_MASK                        0x00000800
#define _IEC2_CCT1IE_LENGTH                      0x00000001

#define _IEC2_CCP2IE_POSITION                    0x0000000C
#define _IEC2_CCP2IE_MASK                        0x00001000
#define _IEC2_CCP2IE_LENGTH                      0x00000001

#define _IEC2_CCT2IE_POSITION                    0x0000000D
#define _IEC2_CCT2IE_MASK                        0x00002000
#define _IEC2_CCT2IE_LENGTH                      0x00000001

#define _IEC2_CCP3IE_POSITION                    0x0000000E
#define _IEC2_CCP3IE_MASK                        0x00004000
#define _IEC2_CCP3IE_LENGTH                      0x00000001

#define _IEC2_CCT3IE_POSITION                    0x0000000F
#define _IEC2_CCT3IE_MASK                        0x00008000
#define _IEC2_CCT3IE_LENGTH                      0x00000001

#define _IEC2_CCP4IE_POSITION                    0x00000010
#define _IEC2_CCP4IE_MASK                        0x00010000
#define _IEC2_CCP4IE_LENGTH                      0x00000001

#define _IEC2_CCT4IE_POSITION                    0x00000011
#define _IEC2_CCT4IE_MASK                        0x00020000
#define _IEC2_CCT4IE_LENGTH                      0x00000001

#define _IEC2_CCP5IE_POSITION                    0x00000012
#define _IEC2_CCP5IE_MASK                        0x00040000
#define _IEC2_CCP5IE_LENGTH                      0x00000001

#define _IEC2_CCT5IE_POSITION                    0x00000013
#define _IEC2_CCT5IE_MASK                        0x00080000
#define _IEC2_CCT5IE_LENGTH                      0x00000001

#define _IEC2_CCP6IE_POSITION                    0x00000014
#define _IEC2_CCP6IE_MASK                        0x00100000
#define _IEC2_CCP6IE_LENGTH                      0x00000001

#define _IEC2_CCT6IE_POSITION                    0x00000015
#define _IEC2_CCT6IE_MASK                        0x00200000
#define _IEC2_CCT6IE_LENGTH                      0x00000001

#define _IEC2_CCP7IE_POSITION                    0x00000016
#define _IEC2_CCP7IE_MASK                        0x00400000
#define _IEC2_CCP7IE_LENGTH                      0x00000001

#define _IEC2_CCT7IE_POSITION                    0x00000017
#define _IEC2_CCT7IE_MASK                        0x00800000
#define _IEC2_CCT7IE_LENGTH                      0x00000001

#define _IEC2_CCP8IE_POSITION                    0x00000018
#define _IEC2_CCP8IE_MASK                        0x01000000
#define _IEC2_CCP8IE_LENGTH                      0x00000001

#define _IEC2_CCT8IE_POSITION                    0x00000019
#define _IEC2_CCT8IE_MASK                        0x02000000
#define _IEC2_CCT8IE_LENGTH                      0x00000001

#define _IEC2_CCP9IE_POSITION                    0x0000001A
#define _IEC2_CCP9IE_MASK                        0x04000000
#define _IEC2_CCP9IE_LENGTH                      0x00000001

#define _IEC2_CCT9IE_POSITION                    0x0000001B
#define _IEC2_CCT9IE_MASK                        0x08000000
#define _IEC2_CCT9IE_LENGTH                      0x00000001

#define _IEC2_FSTIE_POSITION                     0x0000001C
#define _IEC2_FSTIE_MASK                         0x10000000
#define _IEC2_FSTIE_LENGTH                       0x00000001

#define _IEC2_NVMIE_POSITION                     0x0000001E
#define _IEC2_NVMIE_MASK                         0x40000000
#define _IEC2_NVMIE_LENGTH                       0x00000001

#define _IEC2_CPCIE_POSITION                     0x0000001F
#define _IEC2_CPCIE_MASK                         0x80000000
#define _IEC2_CPCIE_LENGTH                       0x00000001

#define _IEC3_ECCBEIE_POSITION                   0x00000001
#define _IEC3_ECCBEIE_MASK                       0x00000002
#define _IEC3_ECCBEIE_LENGTH                     0x00000001

#define _IEC3_DMA0IE_POSITION                    0x00000002
#define _IEC3_DMA0IE_MASK                        0x00000004
#define _IEC3_DMA0IE_LENGTH                      0x00000001

#define _IEC3_DMA1IE_POSITION                    0x00000003
#define _IEC3_DMA1IE_MASK                        0x00000008
#define _IEC3_DMA1IE_LENGTH                      0x00000001

#define _IEC3_DMA2IE_POSITION                    0x00000004
#define _IEC3_DMA2IE_MASK                        0x00000010
#define _IEC3_DMA2IE_LENGTH                      0x00000001

#define _IEC3_DMA3IE_POSITION                    0x00000005
#define _IEC3_DMA3IE_MASK                        0x00000020
#define _IEC3_DMA3IE_LENGTH                      0x00000001

#define _IPC0_CTIS_POSITION                      0x00000000
#define _IPC0_CTIS_MASK                          0x00000003
#define _IPC0_CTIS_LENGTH                        0x00000002

#define _IPC0_CTIP_POSITION                      0x00000002
#define _IPC0_CTIP_MASK                          0x0000001C
#define _IPC0_CTIP_LENGTH                        0x00000003

#define _IPC0_CS0IS_POSITION                     0x00000008
#define _IPC0_CS0IS_MASK                         0x00000300
#define _IPC0_CS0IS_LENGTH                       0x00000002

#define _IPC0_CS0IP_POSITION                     0x0000000A
#define _IPC0_CS0IP_MASK                         0x00001C00
#define _IPC0_CS0IP_LENGTH                       0x00000003

#define _IPC0_CS1IS_POSITION                     0x00000010
#define _IPC0_CS1IS_MASK                         0x00030000
#define _IPC0_CS1IS_LENGTH                       0x00000002

#define _IPC0_CS1IP_POSITION                     0x00000012
#define _IPC0_CS1IP_MASK                         0x001C0000
#define _IPC0_CS1IP_LENGTH                       0x00000003

#define _IPC0_INT0IS_POSITION                    0x00000018
#define _IPC0_INT0IS_MASK                        0x03000000
#define _IPC0_INT0IS_LENGTH                      0x00000002

#define _IPC0_INT0IP_POSITION                    0x0000001A
#define _IPC0_INT0IP_MASK                        0x1C000000
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC1_INT1IS_POSITION                    0x00000000
#define _IPC1_INT1IS_MASK                        0x00000003
#define _IPC1_INT1IS_LENGTH                      0x00000002

#define _IPC1_INT1IP_POSITION                    0x00000002
#define _IPC1_INT1IP_MASK                        0x0000001C
#define _IPC1_INT1IP_LENGTH                      0x00000003

#define _IPC1_INT2IS_POSITION                    0x00000008
#define _IPC1_INT2IS_MASK                        0x00000300
#define _IPC1_INT2IS_LENGTH                      0x00000002

#define _IPC1_INT2IP_POSITION                    0x0000000A
#define _IPC1_INT2IP_MASK                        0x00001C00
#define _IPC1_INT2IP_LENGTH                      0x00000003

#define _IPC1_INT3IS_POSITION                    0x00000010
#define _IPC1_INT3IS_MASK                        0x00030000
#define _IPC1_INT3IS_LENGTH                      0x00000002

#define _IPC1_INT3IP_POSITION                    0x00000012
#define _IPC1_INT3IP_MASK                        0x001C0000
#define _IPC1_INT3IP_LENGTH                      0x00000003

